{
  "categories": [
    {
      "name": "All",
      "id": "all"
    },
    {
      "name": "Professional",
      "id": "professional"
    },
    {
      "name": "Freelance",
      "id": "freelance"
    },
    {
      "name": "Personal",
      "id": "personal"
    }
  ],
  "projects": [
    {
      "id": 1,
      "title": "Full-Stack E-commerce Platform",
      "paragraph": "A comprehensive, scalable e-commerce solution",
      "image": "/images/projects/e-commerce-platform.gif",
      "about": "Developed a robust, full-stack e-commerce platform with advanced features and optimized performance",
      "description": "This project showcases a comprehensive e-commerce ecosystem, built with a responsive React frontend, a robust Node.js backend, and a scalable MongoDB database. Key features include real-time inventory tracking, secure user authentication with JWT, and an intuitive shopping cart system. The platform offers a seamless user experience with a user-friendly checkout process supporting multiple payment options. Advanced functionalities such as intelligent product search and personalized recommendations enhance the shopping experience. The architecture emphasizes scalability, performance, and security, making it suitable for both small businesses and large-scale operations. This full-stack solution demonstrates proficiency in modern web development practices and the ability to create complex, production-ready applications.",
      "technologies": [
        "React",
        "Context API",
        "Node.js",
        "MongoDB"
      ],
      "website": "https://e-commerce-platform-website.netlify.app/",
      "src": "https://github.com/MohamedAbdEl-Rauof/E-Commerce-Platform",
      "category": "personal"
    },
    {
      "id": 2,
      "title": "Bouncing Dot Animation",
      "paragraph": "A simple and elegant CSS animation",
      "image": "/images/projects/bouncing-dot.gif",
      "about": "Freelance project showcasing CSS animation skills",
      "description": "Created a visually appealing bouncing dot animation using HTML and CSS. The project demonstrates proficiency in CSS animations and responsive design.",
      "technologies": [
        "HTML",
        "CSS",
        "CSS Animations"
      ],
      "website": "https://example.com/bouncing-dot",
      "src": "https://github.com/MohamedAbdEl-Rauof/bouncing-dot",
      "category": "freelance"
    },
    {
      "id": 3,
      "title": "Pulsating Ring Animation",
      "paragraph": "An eye-catching CSS animation effect",
      "image": "/images/projects/pulsating-ring.gif",
      "about": "Freelance project demonstrating advanced CSS animation techniques",
      "description": "Developed a captivating pulsating ring animation using HTML and CSS. This project showcases the ability to create complex, smooth animations with pure CSS, enhancing user interface design.",
      "technologies": [
        "HTML",
        "CSS",
        "CSS Animations",
        "Responsive Design"
      ],
      "website": "https://example.com/pulsating-ring",
      "src": "https://github.com/MohamedAbdEl-Rauof/pulsating-ring",
      "category": "freelance"
    },
    {
      "id": 4,
      "title": "Spinning Circle Animation",
      "paragraph": "A smooth and dynamic CSS loading animation",
      "image": "/images/projects/spinning-circle.gif",
      "about": "Freelance project showcasing CSS animation for loading indicators",
      "description": "Developed a sleek spinning circle animation using HTML and CSS. This project demonstrates the ability to create efficient, lightweight loading animations that enhance user experience during wait times.",
      "technologies": [
        "HTML",
        "CSS",
        "CSS Animations",
        "Responsive Design"
      ],
      "website": "https://example.com/spinning-circle",
      "src": "https://github.com/MohamedAbdEl-Rauof/spinning-circle",
      "category": "freelance"
    },
    {
      "id": 5,
      "title": "Vconnct Website",
      "paragraph": "A professional platform connecting users through a seamless digital experience.",
      "image": "/images/projects/vonnctWebsite.gif",
      "about": "Collaborated with a development team to build key components of a professional connection platform.",
      "description": "Worked as part of a team of developers on the Vconnct website project. My primary contributions included implementing secure Single Sign-On (SSO) authentication, building the login and registration systems, and co-developing various frontend components and 'Contact Us' forms. Additionally, I handled the integration and management of Strapi, a headless CMS, to facilitate dynamic content management. The project emphasized clean architecture, reusable components, and a responsive, user-centered design approach using Next.js, TypeScript, Tailwind CSS, and Strapi. This experience highlights my ability to collaborate within a team, build secure authentication systems, and manage content effectively in professional-grade applications.",
      "technologies": [
        "TypeScript",
        "Next.js",
        "Tailwind CSS",
        "Strapi",
        "CSS Animations"
      ],
      "website": "https://vconnct.me",
      "src": "",
      "category": "professional"
    },
    {
      "id": 6,
      "title": "VCloud Control Panel",
      "paragraph": "VCloud is a developer-focused project that provides access to the Vconnct API, enabling the creation of virtual meetings and collaborative tools.",
      "image": "/images/projects/vcloud.gif",
      "about": "Collaborated with a development team to build key components of a professional connection platform featuring beautiful animations and an intuitive user experience.",
      "description": "Contributed to the VCloud Control Panel project as part of a cross-functional development team. My key responsibilities included implementing secure Single Sign-On (SSO) authentication, building the login and registration systems, and integrating multiple payment gateways such as Stripe, Fawry, and Paymob. I also developed automated receipt and invoice generation for users upon successful payment completion, ensuring a seamless and professional user experience.",
      "technologies": [
        "TypeScript",
        "Next.js",
        "Tailwind CSS",
        "Strapi",
        "Vuexy"
      ],
      "website": "https://vcloud.vconnct.me",
      "src": "",
      "category": "professional"
    },
    {
      "id": 7,
      "title": "E-commerce Admin Dashboard",
      "paragraph": "A comprehensive admin panel for managing e-commerce operations",
      "image": "/images/projects/e-commerce-controlpanal.gif",
      "about": "A powerful administrative dashboard for complete e-commerce management with real-time analytics and inventory control",
      "description": "Developed a feature-rich admin dashboard that serves as the nerve center for e-commerce operations. This control panel provides administrators with comprehensive tools to manage products, track inventory, process orders, and manage user accounts. The dashboard features an intuitive interface with real-time analytics, sales reports, and customer insights to facilitate data-driven decision making. Security is implemented through role-based access control, ensuring that sensitive operations are only accessible to authorized personnel. The system includes automated notifications for low stock items and order status changes. For demonstration purposes, you can access the dashboard using the credentials: admin@gmail.com (password: admin123456). This project demonstrates my ability to create complex administrative interfaces that balance functionality with user experience.",
      "technologies": [
        "Next.js",
        "Context API",
        "Node.js",
        "MongoDB",
        "JWT Authentication"
      ],
      "website": "https://e-commerce-platform-website.netlify.app/admin",
      "src": "https://github.com/MohamedAbdEl-Rauof/E-Commerce-Platform",
      "category": "personal"
    }
  ]
}